Documents/Лео_РасчетПремииНепрямымКлиентам/Лео_РасчетПремииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_РасчетПремииНепрямымКлиентам</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВзаимозачет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоставки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расчет</name>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Товароборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеТочки</name>
    <attributes>
      <name>ТорговыеТочки</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/Лео_СоответствиеНоменклатурыНепрямыхКлиентов/Лео_СоответствиеНоменклатурыНепрямыхКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_СоответствиеНоменклатурыНепрямыхКлиентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СетьТорговаТочка</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АртикулВСистемеКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеВСистемеКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AccumulationRegisters/Лео_ПланФактПримииНепрямымКлиентам/Лео_ПланФактПримииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_ПланФактПримииНепрямымКлиентам</name>
  <resources>
    <name>Товарооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Catalogs/Лео_ФокусныйАссортимент/Лео_ФокусныйАссортимент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Лео_ФокусныйАссортимент</name>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Documents/Лео_РасчетПремииНепрямымКлиентам/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИспользоватьВзаимозачетПриИзменении(Элемент)
	Если НЕ Объект.ИспользоватьВзаимозачет Тогда
		Объект.ДоговорПоставки = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Истина;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Объект.ИспользоватьВзаимозачет Тогда
		Объект.ДоговорПоставки = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Истина;
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КнопкаПечать(Команда)
	УниверсальныеМеханизмы.ОткрытьФормуВыбораПечатныхФормОбъекта(ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Лео_РасчетПремииНепрямымКлиентам")), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруИзСоответствия(Команда)
	
	Если Объект.Номенклатура.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Перед заполнением табличная часть будет очищена, продолжить?";
     	Ответ = Вопрос(Текст, Режим, 0);
        Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	
	ПолучитьНоменклатуруИзРегистраСоответствия(Объект.Контрагент,Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруИзРегистраСоответствия(Контрагент,ДатаСреза);

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.СрезПоследних(&ДатаСреза, ) КАК Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних
		|ГДЕ
		|	Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Контрагент = &Контрагент
		|	И Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Регистратор.Дата >= &НачалоРегистрации
		|	И Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.НаименованиеВСистемеКлиента <> &ПустаяСТрока
		|
		|СГРУППИРОВАТЬ ПО
		|	Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";

	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Запрос.УстановитьПараметр("НачалоРегистрации", началогода(ДатаСреза));     ///по ТЗ Коваль К. и Ципулиной П. ограичиваем началом года
	Запрос.УстановитьПараметр("ПустаяСТрока", "");
	Результат = Запрос.Выполнить();


	Результат = Запрос.Выполнить();

	ТзНоменклатура = Результат.Выгрузить();

	Если ТзНоменклатура.Количество()>0 Тогда
	    Объект.Номенклатура.Очистить();
		Объект.Номенклатура.Загрузить(ТзНоменклатура);
	КонецЕсли;


	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоФокусномуАссортименту(Команда)
	Если Объект.Номенклатура.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Перед заполнением табличная часть будет очищена, продолжить?";
     	Ответ = Вопрос(Текст, Режим, 0);
        Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Выбрано = Справочники.Лео_ФокусныйАссортимент.ПустаяСсылка();
	ФормаВыбора = Справочники.Лео_ФокусныйАссортимент.ПолучитьФормуВыбора( , ЭтаФорма); 
    ФормаВыбора.Заголовок	= "Выберите фокусный ассортимент!";
    Выбрано = ФормаВыбора.ОткрытьМодально(); 
	
	Если НЕ Выбрано = Справочники.Лео_ФокусныйАссортимент.ПустаяСсылка() Тогда
		ПолучитьНоменклатуруИзФокусногоАссортимента(Выбрано);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруИзФокусногоАссортимента(ФокусныйАссортимент);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ФокусныйАссортиментСписокНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.Лео_ФокусныйАссортимент.СписокНоменклатуры КАК Лео_ФокусныйАссортиментСписокНоменклатуры
		|ГДЕ
		|	Лео_ФокусныйАссортиментСписокНоменклатуры.Ссылка = &ФокусныйАссортимент";

	Запрос.УстановитьПараметр("ФокусныйАссортимент", ФокусныйАссортимент);

	Результат = Запрос.Выполнить();

	ТзНоменклатура = Результат.Выгрузить();
	
	Если ТзНоменклатура.Количество()>0 Тогда
	    	Объект.Номенклатура.Очистить();
		    Объект.Номенклатура.Загрузить(ТзНоменклатура);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТорговыеТочкиПоДаннымФакта(Команда)
	Если Объект.ТорговыеТочки.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Перед заполнением табличная часть будет очищена, продолжить?";
     	Ответ = Вопрос(Текст, Режим, 0);
        Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТорговыеТочкиПоДаннымФактаНаСервере();
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТорговыеТочкиПоДаннымФактаНаСервере()
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка   как ТорговыеТочки
		|ИЗ
		|	РегистрНакопления.Лео_ПланФактПримииНепрямымКлиентам КАК Лео_ПланФактПримииНепрямымКлиентам
		|ГДЕ
		|	Лео_ПланФактПримииНепрямымКлиентам.Период МЕЖДУ &ДатаС И &ДатаПо
		|	И Лео_ПланФактПримииНепрямымКлиентам.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка";

	Запрос.УстановитьПараметр("ДатаПо", Объект.КонецПериода);
	Запрос.УстановитьПараметр("ДатаС", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);

	Результат = Запрос.Выполнить();

	ТзТорговыеТочки = Результат.Выгрузить();

	Если ТзТорговыеТочки.Количество()>0 Тогда
	    Объект.ТорговыеТочки.Очистить();
		Объект.ТорговыеТочки.Загрузить(ТзТорговыеТочки);
	КонецЕсли;                                                            

КонецПроцедуры
